       FD  ARQUIVO-FUNCIONARIO.
       01  FUNCIONARIO-REGISTRO.
           05 FUNCIONARIO-CODIGO PIC 9(4).
           05 FUNCIONARIO-NOME PIC X(10).
           05 FUNCIONARIO-ENDERECO PIC X(20).
           05 FUNCIONARIO-TELEFONE PIC X(10).
           05 FUNCIONARIO-EMAIL PIC X(30).
