       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG7.
       ENVIRONMENT DIVISION.
       DATA DIVISION.

       PROCEDURE DIVISION.

       PROGRAM-BEGIN.

           DISPLAY "Quem olha para fora sonha e quem olha prara dentro"
      -     "acorda. Carl Gustav Jung Criador da Psicologia Analitica".
